import java.lang.String;
public class Peremen {
    public static void main(String[] args){
        System.out.println("Существуют 8 видов переменных");
        byte  a;//--Целое число от (-128 до 127). [1байт]

        short b;//--Целое число от (-32768 до 32767).[2байт]

        int   c;//--целое число от (-2147483648 до 2147483647). [4байт]

        long  d;//--целое число от (-9223372036854775808 до 9223372036854775807).[8байт]

        float   e;//--число с плавующей точкой от (-3.4E+38 до 3.4E+38).[4байт]

        double  f;//число с плавующей точкой от (-1.7E+308 до 1.7E+308 ).[8байт]

        char    g;//хранит чимвол.[2байт]

        boolean h;//true или false.[1 байт]





    }
}
